# Реализовать вывод информации о промежутке времени в зависимости от его продолжительности duration в секундах.
#
# Формат вывода результата:
# до минуты: <s> сек;
# до часа: <m> мин <s> сек;
# до суток: <h> час <m> мин <s> сек;
# в остальных случаях: <d> дн <h> час <m> мин <s> сек.
#
# Примеры/Тесты:
# duration = 53: 53 сек
# duration = 153: 2 мин 33 сек
# duration = 4153: 1 час 9 мин 13 сек
# duration = 400153: 4 дн 15 час 9 мин 13 сек
#
# Примечание:
# можете проверить себя здесь: https://www.epochconverter.com/
#
# Алгоритм
# Вывод результата зависит только от того, будет ли введенная продолжительность меньше или больше минуты/часа/суток/дня.
# Т.о. надо определить в какой из диапазонов попадает введенная продолжительность:
# [0,1 минута], [1 минута, 1 час] [1 час, 1 день],[1 день и до бесконечности].
# И в зависимости от выполненного условия - вывести результат.
# Подумайте о том, в какое условия должны попасть граничные значения: типа 60 секунд, 60 минут, 24 часа.
# Т.е. 60 минут это только 60 мин или 1 час 00 мин 00 сек? В условии явного требования нет. На ваш выбор.
# Подумайте о том, чтобы избежать повторных операций деления и умножения.
# Вы можете вводить продолжительность с клавиатуры или завести в код.

duration = int(input('Введите время в секундах: '))
ost_sek = duration % 60
minyt = duration // 60
chas = minyt // 60
dni = chas // 24

if minyt == 0:
    print(str(duration) + ' сек')
elif chas == 0:
    print(str(minyt) + ' мин ' + str(ost_sek) + ' сек')
elif dni == 0:
    print(str(chas) + ' час ' + str(minyt % 60) + ' мин ' + str(ost_sek) + ' сек')
else:
    print(str(dni) + ' дн ' + str(chas % 24) + ' час ' + str(minyt % 60) + ' мин ' + str(ost_sek) + ' сек')
