# 3. [Задача со звездочкой]: усложненный вариант задания 2. Доработать функцию currency_rates:
# теперь она должна возвращать курс валюты и дату, которая передаётся в ответе сервера.
# Название новой функции currency_rates_advanced.
#
# Формат вывода результата:
# Вызовите функцию для нескольких валют, обязательно для несуществующей валюты.
#
# Техническое задание
# Все требования задания 2 остаются в силе.
# Функция должна вернуть список или кортеж, содержащий дату и курс валюты.
# Дата должна быть объектом date пакета datetime стандартной библиотеки.
# Для ее создания используйте функции пакета datetime. Если это слишком сложно - оставьте дату строкой.
#
# Примеры/Тесты:
#
# >>> url = "<http://www.cbr.ru/scripts/XML_daily.asp>"
# >>> currency_rates_advanced(url, "USd")
# ([datetime.date(2021, 10, 15)], 71.7846)
# >>> currency_rates_advanced(url, "EuR")
# ([datetime.date(2021, 10, 15)], 83.3347)
# >>> currency_rates_advanced(url, "GBP")
# ([datetime.date(2021, 10, 15)], 98.3449)
# >>> currency_rates_advanced(url, "GBP2")
# ([datetime.date(2021, 10, 15)], None)
#
# Алгоритм
# Посмотрите ответ сервера, как с минимальными усилиями вытащить оттуда дату?
# Подумайте можно ли, и правильно ли вызывать из этой функции функцию предыдущей задачи: currency_rates
# Если есть требования, что мы используем обе функции в своей работе, как соблюсти принцип DRY?