## 3.Дан список, содержащий искаженные данные с должностями и именами сотрудников:
## ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']
## Известно, что имя сотрудника всегда в конце строки.
## Сформировать и вывести на экран фразы вида: 'Привет, Игорь!'
## Подумать, как получить имена сотрудников из элементов списка, как привести их к корректному виду?
## Можно ли при этом не создавать новый список?

lst = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']
for el in lst:
    el = el.split()
    rez_str = "Привет, " + el[-1].title() + "!"
    print(rez_str)