# 5. [Задача со звездочкой]: усложненный вариант задания 4.
# Добавить возможность редактирования данных при помощи отдельного скрипта.
#
# Техническое задание
# Скрипт получает два параметра: номер записи и новое значение
# Файл не должен считываться в память целиком. Обязательно.
# Предусмотреть ситуацию, когда пользователь вводит номер записи, которой не существует: ничего в файле не меняем,
# выводим сообщение в консоль.
#
# Алгоритм
# Здесь есть сложность с записью «между другими данными». Подумайте как преодолеть эту сложность.
# В задаче нет ограничения на формат записываемых данных.
