# 4. Написать скрипт, который для заданной папки выводит статистику размеров файлов
#
# Формат вывода результата:
#
# {
#   100: 15,
#   1000: 3,
#   10000: 7,
#   100000: 2
# }
#
# Тут 15 файлов размером не более 100 байт; 3 файла больше 100 и не больше 1000 байт...;
#
# Техническое задание
# Директорию с файлами some_data можно скачать из прикрепленных к уроку файлов.
# Результат возвращается в виде словаря
# ключи — верхняя граница размера файла (пусть будет кратна 10)
# значения — общее количество файлов (в том числе и в подпапках), размер которых не превышает этой границы, но больше предыдущей (начинаем с 0)
# Программа должна легко модифицироваться под другие границы диапазонов или увеличение их количества.
#
# Примечание:
# размер файла можно получить из атрибута .st_size объекта os.stat.
