# 6. [Задача со звездочкой]: усложненный вариант задания 5.
# Добавьте в функцию еще один аргумент — флаг, разрешающий или запрещающий повторы слов в шутках:
# каждое слово можно использовать только в одной шутке.
#
# Техническое задание
# Проверьте работу функции для разного количества шуток. Убедитесь в том, что каждое слово встречается только один раз.
#
# Примечание:
# Внимательно посмотрите какие из функций модуля random, упомянутые в методичке, подходят для реализации уникальности.
# Подумайте о том, сколько шуток можно вернуть при требовании уникальности, как это связано с размерами списков.



