# 3. Реализовать склонение слова «процент» для чисел до 20.
# Например, задаем число 5 — получаем «5 процентов»,
# задаем число 2 — получаем «2 процента». Вывести все склонения для проверки.

percent = 0
# Можно и цикл for in, но на уроке 1 мы его не рассматривали
while percent <= 234:
    remain = percent % 100
    if remain >= 20:
        remain %= 10
    if remain == 1:
        print(percent, "процент")
    elif 2 <= remain  <= 4:
        print(percent, "процента")
    else:
        print(percent, "процентов")
    percent += 1
