# 2. Для целых нечетных чисел от 1 до 1000.
# Вычислить сумму и вывести на экран те числа, сумма цифр которых делится нацело на 7.
# Например, число «19 ^ 3 = 6859» будем включать в сумму, так как 6 + 8 + 5 + 9 = 28 – делится нацело на 7.
# Внимание: использовать только арифметические операции!
# Вывод на экран формить в виде:  число: xxxxxxx sum: xxx
# **Алгоритм:**
# 1) Сначала разберитесь просто с выделением разрядов числа(цифр).
# Это делается за счет целочисленного деления на 10 и взятие остатка от этого деления.
# Не используйте операции со строками. Поэкспериментируйте.
# 2) Сделайте этот алгоритм для произвольного числа - вам понадобится цикл.
# Отладьте этот алгоритм и подсчитайте сумму цифр.
# 3) Сделайте алгоритм предыдущего пунка частью цикла по числам от 1 до 1000.

sum_numbers = 0
counter = 1
while counter <= 1000:
    number = counter ** 3
    number_check = number
    digit_sum = 0
    while True:
        digit_sum += number_check % 10
        number_check //= 10
        if number_check == 0:
            break
    if digit_sum % 7 == 0:
        sum_numbers += counter
        print(counter,"^3:", number, "sum:", sum_numbers, "[", digit_sum,"]")
    counter += 2 # Нечетность
